STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE_Thread/BLE_HeartRate_Thread_SED_FreeRTOS/STM32_WPAN/App/app_ble.c
/* Host stack buffers */
static osMemoryPoolId_t host_pool;
static osMemoryPoolId_t gatt_pool;
static osMemoryPoolId_t host_event_pool;
static osMemoryPoolId_t host_nvm_pool;
static osMemoryPoolId_t long_write_pool;
static osMemoryPoolId_t extra_data_pool;
static uint32_t *host_buffer;
static uint32_t *gatt_buffer;
static uint16_t *host_event_buffer;
static uint64_t *host_nvm_buffer;
static uint8_t *long_write_buffer;
static uint8_t *extra_data_buffer;

/* USER CODE BEGIN PV */
uint8_t a_GATT_DevInfoData[22];
/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/
osSemaphoreId_t       BleHostSemaphore;
osSemaphoreId_t       GapProcCompleteSemaphore;

const osSemaphoreAttr_t BleHostSemaphore_attributes = {
  .name         = "BLE Host Semaphore",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE
};

const osSemaphoreAttr_t GapProcCompleteSemaphore_attributes = {
  .name         = "GAP procedure complete Semaphore",
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE
};

/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/
static uint8_t HOST_BLE_Init(void);
static void BLE_ResumeFlowProcessCallback(void);
static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus);
static void Ble_Hci_Gap_Gatt_Init(void);
static const uint8_t* BleGenerateIRValue(void);
static const uint8_t* BleGenerateERValue(void);
static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);
/* USER CODE BEGIN PFP */
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size, const uint8_t *p_bd_addr);

/* USER CODE END PFP */

/* External functions prototypes ---------------------------------------------*/

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Functions Definition ------------------------------------------------------*/
void APP_BLE_Init(void)
{
  /* USER CODE BEGIN APP_BLE_Init_1 */

  /* USER CODE END APP_BLE_Init_1 */

  LST_init_head(&BleAsynchEventQueue);

  /* Create memory pools for BLE */
  host_pool = osMemoryPoolNew(1, BLE_DYN_ALLOC_SIZE, NULL);
  gatt_pool = osMemoryPoolNew(1, BLE_GATT_BUF_SIZE, NULL);
  host_event_pool = osMemoryPoolNew(1, BLE_HOST_EVENT_BUF_SIZE, NULL);
  host_nvm_pool = osMemoryPoolNew(1, CFG_BLE_NVM_SIZE_MAX*8, NULL);
  long_write_pool = osMemoryPoolNew(1, CFG_BLE_LONG_WRITE_DATA_BUF_SIZE, NULL);
  extra_data_pool = osMemoryPoolNew(1, CFG_BLE_EXTRA_DATA_BUF_SIZE, NULL);

  /* Allocate buffers for BLE */
  host_buffer = osMemoryPoolAlloc(host_pool, osWaitForever);
  gatt_buffer = osMemoryPoolAlloc(gatt_pool, osWaitForever);
  host_event_buffer = osMemoryPoolAlloc(host_event_pool, osWaitForever);
  host_nvm_buffer  = osMemoryPoolAlloc(host_nvm_pool, osWaitForever);
  long_write_buffer = osMemoryPoolAlloc(long_write_pool, osWaitForever);
  extra_data_buffer = osMemoryPoolAlloc(extra_data_pool, osWaitForever);

  /* Check allocation */
  if (((host_buffer == NULL) && (BLE_DYN_ALLOC_SIZE != 0))
      || ((gatt_buffer == NULL) && (BLE_GATT_BUF_SIZE != 0))
      || ((host_event_buffer == NULL) && (BLE_HOST_EVENT_BUF_SIZE != 0))
      || ((host_nvm_buffer == NULL) && (CFG_BLE_NVM_SIZE_MAX != 0))
      || ((long_write_buffer == NULL) && (CFG_BLE_LONG_WRITE_DATA_BUF_SIZE != 0))
      || ((extra_data_buffer == NULL) && (CFG_BLE_EXTRA_DATA_BUF_SIZE != 0)))
  {
    /* Buffer allocation failed, check FreeRTOS Heap size */
    Error_Handler();
  }

  /* Initialise NVM RAM buffer, invalidate it's content before restoration */
  host_nvm_buffer[0] = 0;

  /* Register A NVM buffer for BLE Host stack */
  SNVMA_Register(APP_BLE_NvmBuffer,
                  (uint32_t *)host_nvm_buffer,
                  (CFG_BLE_NVM_SIZE_MAX * 2));

  /* Realize a restore */
  SNVMA_Restore(APP_BLE_NvmBuffer);
  /* USER CODE BEGIN APP_BLE_Init_Buffers */

  /* USER CODE END APP_BLE_Init_Buffers */

  /* Initialize BLE related modules */
  BAES_Reset( );
  PKACTRL_Reset();
  BLE_TIMER_Init();

  /* Initialize the BLE Host */
  if (HOST_BLE_Init() == 0u)
  {
    /* Initialization of HCI & GATT & GAP layer */
    Ble_Hci_Gap_Gatt_Init();

    GapProcCompleteSemaphore = osSemaphoreNew(1U, 0U, &GapProcCompleteSemaphore_attributes);
    if (GapProcCompleteSemaphore == NULL)
    {
      Error_Handler();
    }

    /* Initialization of the BLE Services */
    SVCCTL_Init();

    /* Initialization of the BLE App Context */
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    bleAppContext.connectionHandle = 0xFFFF;

    /* From here, all initialization are BLE application specific */

    /* USER CODE BEGIN APP_BLE_Init_4 */

    /* USER CODE END APP_BLE_Init_4 */

    /* Initialize Services and Characteristics. */
    LOG_INFO_APP("\n");
    LOG_INFO_APP("Services and Characteristics creation\n");
    HRS_APP_Init();
    DIS_APP_Init();
    LOG_INFO_APP("End of Services and Characteristics creation\n");
    LOG_INFO_APP("\n");

    /* USER CODE BEGIN APP_BLE_Init_3 */
    
    uint16_t adv_cmd = 0;
    osMessageQueuePut(advertisingCmdQueueHandle, &adv_cmd, 0U, 0U);
    
    /* USER CODE END APP_BLE_Init_3 */

  }
  /* USER CODE BEGIN APP_BLE_Init_2 */
  bleAppContext.connIntervalFlag = 0;
  /* USER CODE END APP_BLE_Init_2 */

  return;
}

/* All BLE activities must be stopped before calling this API */
void APP_BLE_Deinit(void)
{
  /* USER CODE BEGIN APP_BLE_Deinit_1 */

  /* USER CODE END APP_BLE_Deinit_1 */

  aci_reset(0, 0);

  /* Free memory buffers */
  osMemoryPoolFree(host_buffer, host_pool);
  osMemoryPoolFree(host_buffer, gatt_pool);
  osMemoryPoolFree(host_buffer, host_event_pool);
  osMemoryPoolFree(host_buffer, host_nvm_pool);
  osMemoryPoolFree(host_buffer, long_write_pool);
  osMemoryPoolFree(host_buffer, extra_data_pool);

